{
  "backend/main.mo": "Defines a canister storing sarees with CRUD-style queries for all items, offers, and new arrivals.",
  "feature_evidence.json": "Structured feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS theme variables and dark mode styles for the app’s design system.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and app layout with bottom navigation.",
  "frontend/src/appConfig.ts": "Stores business configuration and provides a helper for generating WhatsApp order links.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with route-based highlighting.",
  "frontend/src/components/LoadingGrid.tsx": "Skeleton grid component shown while catalog data loads.",
  "frontend/src/components/SareeCard.tsx": "Displays saree info, badges, image, price, and WhatsApp order button with navigation to details.",
  "frontend/src/components/WhatsAppOrderButton.tsx": "Button component that opens WhatsApp with a prefilled product message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using identity state, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSarees.ts": "Defines React Query hooks to fetch saree lists, offers, new arrivals, and individual sarees via an actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, typography, background pattern, and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Catalog.tsx": "Displays the full saree catalog with loading, error, and empty states using SareeCard components.",
  "frontend/src/pages/Contact.tsx": "Renders contact options including WhatsApp, phone, and map links along with business info.",
  "frontend/src/pages/Home.tsx": "Home page with hero section, quick navigation shortcuts, welcome text, and footer.",
  "frontend/src/pages/NewArrivals.tsx": "Shows newly added sarees with loading, error, and empty states using SareeCard components.",
  "frontend/src/pages/Offers.tsx": "Lists sarees on special offer with handling for loading, errors, and empty results.",
  "frontend/src/pages/ProductDetails.tsx": "Product details page that loads a saree by ID, shows its image, price, offer/new arrival tags, and provides a WhatsApp order button with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, container settings, and custom themes for the app.",
  "project_state.json": "Project metadata describing app goals, features, images, and architectural notes for the Suvarna Collection mobile app."
}